package lessons.lesson_2;

// Создать четыре целочисленные переменные типов byte, short, int, long
public class hw_01 {
    public static void main(String[] args) {
////        1. Создать четыре целочисленные переменные типов byte, short, int, long.
//        byte b1;
//        short sh1;
//        int i;
//        long l;
//
////        2. Инициализировать переменную типа byte результатом суммы двух любых чисел.
////        3. Инициализировать переменную типа short  результатом вычитания двух любых чисел.
////        4. Инициализировать переменную типа int результатом деления двух любых чисел.
////        5. Инициализировать переменную типа long результатом умножения двух любых чисел.
//        b1 = 6 + 5;
//        sh1 = 8 - 5;
//        i = 9 / 3;
//        l = 6 * 3;
//        System.out.println("b1 = " + b1);
//        System.out.println("sh1 = " + sh1);
//        System.out.println("i = " + i);
//        System.out.println("l = " + l);
//        System.out.println();
//
////        6. Передать переменной типа byte результат суммы двух переменных типа byte.
//        byte b2 = 8;
//        byte b3 = (byte) (b1 + b2);
//        System.out.println("b3 = " + b3);
//        System.out.println();
//
////        7. Передать переменной типа byte результат суммы двух переменных типа short, деленных на третью переменную типа byte.
//        short sh2 = 45;
//        short sh3 = (short) (sh1 + sh2);
//        b3 = (byte) (sh3 / b3);
//        System.out.println("Answer for less 7 is: ");
//        System.out.println("b3 = " + b3);
//        System.out.println();
//
////        8. Переменной типа int передать результат деления двух short, умноженных на результат деления двух byte.
//        sh3 = (short) (sh1 / sh2);
//        b3 = (byte) (b2 / b1);
//        System.out.println(sh3);
//        System.out.println("");
//
//        i = sh3 * b3;
//        System.out.println("i = " + i);
//        System.out.println();
//
////        9. Поменять значения двух целочисленных переменных используя третью.

    }
}
